sirfonzie/esp32c3-mtk3/sdkconfig.defaults.wifi_ble
# Kernel + WiFi + BLE  [EXPERIMENTAL — not fully stable]
# Usage: idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults.wifi_ble" build
#
# WARNING: Simultaneous WiFi + BLE may cause occasional resets under heavy
# load. For evaluation only. Not recommended for production.
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_MTK3_KERNEL_WIFI_BLE=y

# WiFi
CONFIG_LWIP_ENABLE=y

# Hardware coexistence (required when both radios are active)
# wifi_init_run() must be called before nimble_port_init() so that the ROM
# coex context pointer is valid when the BLE controller starts.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Reduce static WiFi RX buffers to reclaim ~10 KB of contiguous internal RAM
# for the NimBLE host task stack (default 10×1600 B → 4×1600 B = −9.6 KB).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_BLE_CCA_MODE_HW=y
CONFIG_BT_BLE_CCA_MODE=1
